Revit 2027 API
UnitTypeId.NewtonMetersPerMeter Property
 Newton meters per meter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId NewtonMetersPerMeter { get; }
Public Shared ReadOnly Property NewtonMetersPerMeter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ NewtonMetersPerMeter {
	ForgeTypeId^ get ();
}
static member NewtonMetersPerMeter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace